In [31]:
import pandas as pd
import numpy as np

In [55]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [56]:
df['FlightNumber'].isnull()

0    False
1     True
2    False
3     True
4    False
Name: FlightNumber, dtype: bool

In [57]:
#df['FlightNumber'].fillna(value = ,inplace=True)

In [58]:
t=df['FlightNumber'].shape[0]

In [59]:
for i in range(0,t):
    if pd.isnull(df['FlightNumber'].loc[i,]):
        df.loc[i,'FlightNumber']=df.FlightNumber.loc[i-1,]+10

In [60]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [62]:
df['FlightNumber'].astype(int)

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

In [94]:
""""The From_To column would be better as two separate columns! Split each 
string on the underscore delimiter _ to give a new temporary DataFrame with 
the correct values. Assign the correct column names to this temporary 
DataFrame."""
temp_df=df.copy()

temp_df[['From','To']]=df['From_To'].str.split('_',expand=True)

In [95]:
temp_df['From']

0      LoNDon
1      MAdrid
2      londON
3    Budapest
4    Brussels
Name: From, dtype: object

In [96]:
#temp_df.columns.str.lower()

In [131]:
 """Notice how the capitalisation of the city names is all mixed up in this 
temporary DataFrame. Standardise the strings so that only the first letter is 
uppercase (e.g. "londON" should become "London".)"""
    
temp_df['From']=temp_df['From'].str.lower()
temp_df['From']=temp_df['From'].str.capitalize()
temp_df['From_To']=temp_df['From_To'].str.capitalize()
temp_df['To']=temp_df['To'].str.capitalize()

In [ ]:
"""Delete the From_To column from df and attach the temporary DataFrame 
from the previous questions."""

df.drop('From_To',axis=1,inplace=True)

In [99]:
df['From_To']=temp_df['From_To']

In [119]:
"""In the RecentDelays column, the values have been entered into the 
DataFrame as a list. We would like each first value in its own column, each 
second value in its own column, and so on. If there isn't an Nth value, the value 
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns 
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df 
with delays."""

df1=pd.DataFrame(temp_df['RecentDelays'].values.tolist())

In [120]:
df1

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [121]:
nocols=df1.shape[1]
nocols

3

In [122]:
coldict={}
for i in range(0,nocols):
    key=df1.columns[i]
    val='delay'+ str(i)
    coldict[key]=val
print(coldict)

{0: 'delay0', 1: 'delay1', 2: 'delay2'}

In [123]:
df1.rename(columns=coldict,inplace=True)

In [124]:
df1

   delay0  delay1  delay2
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [113]:
temp_df

,From_To,FlightNumber,RecentDelays,Airline,from,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),"[LoNDon, paris]",LoNDon,paris
1,MAdrid_miLAN,10055.0,[],<Air France> (12),"[MAdrid, miLAN]",MAdrid,miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),"[londON, StockhOlm]",londON,StockhOlm
3,Budapest_PaRis,10075.0,[13],12. Air France,"[Budapest, PaRis]",Budapest,PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""","[Brussels, londOn]",Brussels,londOn

In [125]:
temp_df[['delay1','delay2','delay3']]=df1[['delay0','delay1','delay2']]

In [132]:
temp_df

,From_To,FlightNumber,Airline,from,From,To,delay1,delay2,delay3
0,London_paris,10045.0,KLM(!),"[LoNDon, paris]",London,Paris,23.0,47.0,NaN
1,Madrid_milan,10055.0,<Air France> (12),"[MAdrid, miLAN]",Madrid,Milan,NaN,NaN,NaN
2,London_stockholm,10065.0,(British Airways. ),"[londON, StockhOlm]",London,Stockholm,24.0,43.0,87.0
3,Budapest_paris,10075.0,12. Air France,"[Budapest, PaRis]",Budapest,Paris,13.0,NaN,NaN
4,Brussels_london,10085.0,"""Swiss Air""","[Brussels, londOn]",Brussels,London,67.0,32.0,NaN

In [128]:
temp_df.drop('RecentDelays',axis=1,inplace=True)